ELPasEDT/src/Catalogs/КомплектыУчетныхЕдиниц/КомплектыУчетныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомплектыУчетныхЕдиниц</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ELPasEDT/src/InformationRegisters/БазовыеЕдиницыИзмеренияРеагентов/БазовыеЕдиницыИзмеренияРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БазовыеЕдиницыИзмеренияРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>БазоваяЕдиницаИзмеренияОбъема</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Catalogs/КомплектыУчетныхЕдиниц/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьБазовыеЕдиницы();
КонецПроцедуры

&НаСервере
Процедура РеагентПриИзмененииНаСервере()
	УстановитьБазовыеЕдиницы();
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	РеагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьБазовыеЕдиницы()
	
	Если Не ЗначениеЗаполнено(Объект.Реагент) Тогда
		БазоваяЕдиницаКоличества   = Неопределено;
		БазоваяЕдиницаКонцентрации = Неопределено;
		БазоваяЕдиницаПлотности    = Неопределено;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента");
	Запрос.УстановитьПараметр("ВидРеагента", Объект.Реагент.ВидРеагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		БазоваяЕдиницаКоличества = Выборка.ЕдиницаИзмеренияКоличества;
		БазоваяЕдиницаКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрации;
		БазоваяЕдиницаПлотности = Выборка.ЕдиницаИзмеренияПлотности;
	КонецЕсли;
	
КонецПроцедуры
